Repository: APB97/WebSudoku
Catalog: WebSudoku/ResxResources/Pages/Index.*.resx
Languages: pl_pl

source: features and rules
pl_pl: funkcjonalności i zasady

source: Features
pl_pl: Funkcjonalności

source: Print multiple ones
pl_pl: Drukuj wiele sudoku

source: or
pl_pl: lub

source: To start playing use the navigation menu or press the button below.
pl_pl: Aby zacząć, skorzystaj z menu nawigacyjnego lub użyj przycisku poniżej.

source: Saving and loading
pl_pl: Zapisywanie i odczytywanie

source: New
pl_pl: Nowość

source: Print multiple
pl_pl: Drukuj wiele

source: Clear all
pl_pl: Wyczyść wszystko

source: Start playing
pl_pl: Rozpocznij

source: Separate page which allows preparing mulitple sudoku boards and allows generating adjustable amount of additional sudoku boards at once.
pl_pl: Osobna strona która pozwala na przygotowanie wielu sudoku do druku i umożliwia wygenerowanie dostosowywalnej ilości dodatkowych sudoku naraz.

source: Every board can be regenerated or removed.
pl_pl: Każde sudoku może być wygenerowane ponownie lub usunięte.

source: Also includes
pl_pl: Ponadto zawiera przycisk

source: button for starting from scratch by clearing all boards on the page.
pl_pl: pozwalający na rozpoczęcie od nowa poprzez wyczyszczenie wszystkich sudoku na stronie.

source: Sudoku rules
pl_pl: Reguły sudoku

source: Sudoku board is divided into 9 squares with 3x3 grid of cells.
pl_pl: Sudoku jest podzielone na 9 kwadratów z siatką komórek 3 na 3.

source: Each cell on the board should be filled with digits 1 through 9.
pl_pl: Każda komórka powinna być uzupełniona cyfrą od 1 do 9.

source: Inside of each 3x3 square, column and row, any given digit can appear only once.
pl_pl: Wewnątrz każdego kwadratu 3 na 3, kolumny i wiersza, dowolna cyfra może pojawić się tylko raz.

source: You start a game with a board where some of the cells have been assigned a digit that cannot be changed.
pl_pl: Zaczynasz grę z sudoku, którego część komórek ma przydzieloną wartość, której nie można zmienić.

source: You should fill the board according to the rules.
pl_pl: Należy uzupełnić sudoku zgodnie z regułami gry.

source: Sudoku state can be saved and loaded.
pl_pl: Stan sudoku może być zapisany i wczytany.

source: Currently saves to and loads from browser's LocalStorage.
pl_pl: Obecnie zapiuje i wczytuje z lokalnej pamięci przeglądarki.

source: Printing
pl_pl: Drukowanie

source: You can print the sudoku board with ability to adjust the following options
pl_pl: Można wydrukować sudoku z następującymi opcjami

source: Print filled values
pl_pl: Drukuj uzupełnione wartości

source: Print highlighted errors
pl_pl: Drukuj podświetlone błędy

source: if checked
pl_pl: jeśli zaznaczona

source: this option will include user-filled cell values in the printed version.
pl_pl: ta opcja dołączy wartości uzupełnione przez użytkownika w wydruku.

source: This option must be checked for option
pl_pl: Ta opcja musi być zaznaczona, aby opcja

source: to be available.
pl_pl: była dostępna.

source: Print backgrounds
pl_pl: Drukuj tła

source: and given that there is active highlighting of conflicting cell values
pl_pl: i pod warunkiem, że jest aktywne podświetlenie niezgodnych wartości komórek

source: this option will include highlighting of errors in the printed version.
pl_pl: ta opcja dołączy podświetlenie błędów w wydruku

source: Please note that for this option to take effect, You need to enable option
pl_pl: Należy zauważyć, że aby ta opcja zadziałała, trzeba włączyć opcję

source: while preparing printed sudoku.
pl_pl: podczas przygotowywania sudoku do druku.

source: Validation
pl_pl: Walidacja

source: Any editable cells' values conflicting with sudoku rules are highlighted automatically after changing cell's value.
pl_pl: Wartości każdej edytowalnej komórki, które są niezgodne z zasadami sudoku są automatycznie podśwetlane po zmianie wartości komórki.

source: Navigation
pl_pl: Nawigacja

source: You can navigate cells within the sudoku board using arrow keys.
pl_pl: Można nawigować między komórkami wewnątrz sudoku za pomocą strzałek.

source: Supports moving between the first and the last cell in a row or column.
pl_pl: Wspiera przemieszczanie pomiędzy pierwszą i ostatnią komórką w wierszu lub kolumnie.

source: Pressing 'Enter' allows to navigate to the next cell, or to the top-left one if pressed in the bottom-right cell.
pl_pl: Wciskając 'Enter' można nawigować do następnej komórki, lub do komórki w lewym górnym rogu, jeżeli wciśnięty został w komórce w prawym dolnym rogu.

source: Target cell will have its value selected.
pl_pl: Wartość docelowej komórki zostanie zaznaczona.
